# Module 1 - Manipulating data with Pandas
## Pandas Part 2

![austin](http://www.austintexas.gov/sites/default/files/aac_logo.jpg)

## Scenario:
You have decided that you want to start your own animal shelter, but you want to get an idea of what that will entail and get more information about planning. In this lecture, we are continue to look at a real data set collected by Austin Animal Center over several years and use our pandas skills from the last lecture and learn some new ones in order to explore this data further.

#### _Our goals today are to be able to_: <br/>

Use the pandas library to:

- Get summary info about a dataset and its variables
  - Apply and use info, describe and dtypes
  - Use mean, min, max, and value_counts 
- Use apply and applymap to transform columns and create new values

- Explain lambda functions and use them to use an apply on a DataFrame
- Explain what a groupby object is and split a DataFrame using a groupby
- Reshape a DataFrame using joins, merges, pivoting, stacking, and melting

## Getting started

Let's take a moment to examine the [Austin Animal Center data set](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Outcomes/9t4d-g238/data). What kinds of questions can we ask this data and what kinds of information can we get back?

In pairs and as a class, let's generate ideas.

## Switch gears

Before we answer those questions about the animal shelter data, let's practice on a simpler dataset.
Read about this dataset here: https://www.kaggle.com/ronitf/heart-disease-uci
![heart-data](images/heartbloodpres.jpeg)

The dataset is most often used to practice classification algorithms. Can one develop a model to predict the likelihood of heart disease based on other measurable characteristics? We will return to that specific question in a few weeks, but for now we wish to use the dataset to practice some pandas methods.

### 1. Get summary info about a dataset and its variables

Applying and using `info`, `describe`, `mean`, `min`, `max`, `apply`, and `applymap` from the Pandas library

The Pandas library has several useful tools built in. Let's explore some of them.

In [1]:
!pwd
!ls -al

/Users/tingtingli/TING_GitHub/dc_ds_06_03_19/module_1/week_2/day_1_manipulating_data_pandas
total 88
drwxr-xr-x  9 tingtingli  staff    306 Jun 10 10:14 .
drwxr-xr-x  3 tingtingli  staff    102 Jun 10 10:12 ..
drwxr-xr-x  2 tingtingli  staff     68 Jun 10 10:14 .ipynb_checkpoints
-rw-r--r--  1 tingtingli  staff     95 Jun 10 10:12 ds_chars.csv
-rw-r--r--  1 tingtingli  staff  11328 Jun 10 10:12 heart.csv
drwxr-xr-x  4 tingtingli  staff    136 Jun 10 10:12 images
-rw-r--r--  1 tingtingli  staff  17390 Jun 10 10:12 manipulating_data_with_pandas.ipynb
-rw-r--r--  1 tingtingli  staff   3297 Jun 10 10:12 pre_process_animal_shelter_data.py
-rw-r--r--  1 tingtingli  staff    130 Jun 10 10:12 states.csv

In [2]:
import pandas as pd
uci = pd.read_csv('heart.csv')

In [3]:
uci.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

#### The `.columns` and `.shape` Attributes

```python
# reset columns
uci.columns = uci.columns.str.upper()
# can not change df.shape
```

In [5]:
uci.columns

Index(['age', 'sex', 'cp', 'trestbps', 'chol', 'fbs', 'restecg', 'thalach',
       'exang', 'oldpeak', 'slope', 'ca', 'thal', 'target'],
      dtype='object')

In [6]:
uci.shape

(303, 14)

#### The `.info() `and `.describe()` and `.dtypes` methods

Pandas DataFrames have many useful methods! Let's look at `.info()` , `.describe()`, and `dtypes`.

In [7]:
# Call the .info() method on our dataset. What do you observe?

uci.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
age         303 non-null int64
sex         303 non-null int64
cp          303 non-null int64
trestbps    303 non-null int64
chol        303 non-null int64
fbs         303 non-null int64
restecg     303 non-null int64
thalach     303 non-null int64
exang       303 non-null int64
oldpeak     303 non-null float64
slope       303 non-null int64
ca          303 non-null int64
thal        303 non-null int64
target      303 non-null int64
dtypes: float64(1), int64(13)
memory usage: 33.2 KB

**CAUTION**

```python
# In python, var_new = var (only pointing to the same memory, not actually create a new variable) 

uci_new = uci #only pointing to the same memory, does not create a new df
uci_new['new_col'] = 'A'
# both uci & uci_new have the new col
uci_new = uci.copy() #create a new df
```

In [8]:
# Call the .describe() method on our dataset. What do you observe?

uci.describe()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
count,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000
mean,54.366337,0.683168,0.966997,131.623762,246.264026,0.148515,0.528053,149.646865,0.326733,1.039604,1.399340,0.729373,2.313531,0.544554
std,9.082101,0.466011,1.032052,17.538143,51.830751,0.356198,0.525860,22.905161,0.469794,1.161075,0.616226,1.022606,0.612277,0.498835
min,29.000000,0.000000,0.000000,94.000000,126.000000,0.000000,0.000000,71.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,47.500000,0.000000,0.000000,120.000000,211.000000,0.000000,0.000000,133.500000,0.000000,0.000000,1.000000,0.000000,2.000000,0.000000
50%,55.000000,1.000000,1.000000,130.000000,240.000000,0.000000,1.000000,153.000000,0.000000,0.800000,1.000000,0.000000,2.000000,1.000000
75%,61.000000,1.000000,2.000000,140.000000,274.500000,0.000000,1.000000,166.000000,1.000000,1.600000,2.000000,1.000000,3.000000,1.000000
max,77.000000,1.000000,3.000000,200.000000,564.000000,1.000000,2.000000,202.000000,1.000000,6.200000,2.000000,4.000000,3.000000,1.000000

In [9]:
# Use the code below. How does the output differ from info() ?
uci.dtypes

age           int64
sex           int64
cp            int64
trestbps      int64
chol          int64
fbs           int64
restecg       int64
thalach       int64
exang         int64
oldpeak     float64
slope         int64
ca            int64
thal          int64
target        int64
dtype: object

#### `.mean()`, .`min()`,` .max()`, `.sum()`

The methods `.mean()`, `.min()`, and `.max()` will perform just the way you think they will!

Note that these are methods both for Series and for DataFrames.

In [10]:
uci.ca.mean()

0.7293729372937293

#### The Axis Variable

**axis =0 : collapsing the rows, going across rows**

**axis =1 : collapsing the cols, going across cols**

In [11]:
uci.sum(axis=0) # Try [shift] + [tab] here!

age         16473.0
sex           207.0
cp            293.0
trestbps    39882.0
chol        74618.0
fbs            45.0
restecg       160.0
thalach     45343.0
exang          99.0
oldpeak       315.0
slope         424.0
ca            221.0
thal          701.0
target        165.0
dtype: float64

In [12]:
uci.ca.count() #count non-null values

303

**None vs NaN**

**is vs ==**

In [13]:
None == None #absence of anything

True

In [16]:
import numpy as np

In [19]:
type(np.nan)

float

In [17]:
np.nan == np.nan

False

In [20]:
np.NaN is np.NaN

True

```python
Series.notna()
Series.isna()
```

In [22]:
uci.ca.isna().any() # or: all()

False

#### .`value_counts()`

For a DataFrame _Series_, the `.value_counts()` method will tell you how many of each value you've got.

In [23]:
uci['age'].value_counts()[:10]

58    19
57    17
54    16
59    14
52    13
51    12
62    11
44    11
60    11
56    11
Name: age, dtype: int64

Exercise: What are the different values for restecg?

```python
pd.Series.<tab> #to access Series funtions
```

In [30]:
uci['restecg'].value_counts()

1    152
0    147
2      4
Name: restecg, dtype: int64

In [31]:
uci['restecg'].nunique()

3

In [29]:
# Your code here!
uci['restecg'].unique()   #or set(list())

array([0, 1, 2])

### Apply to Animal Shelter Data
Using `.info()` and `.describe()` and `dtypes` what observations can we make about the data?

What are the breed value counts?

How about age counts for dogs?

In [4]:
animal_outcomes = pd.read_csv('https://data.austintexas.gov/api/views/9t4d-g238/rows.csv?accessType=DOWNLOAD')

In [32]:
animal_outcomes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101475 entries, 0 to 101474
Data columns (total 12 columns):
Animal ID           101475 non-null object
Name                69834 non-null object
DateTime            101475 non-null object
MonthYear           101475 non-null object
Date of Birth       101475 non-null object
Outcome Type        101468 non-null object
Outcome Subtype     46103 non-null object
Animal Type         101475 non-null object
Sex upon Outcome    101473 non-null object
Age upon Outcome    101455 non-null object
Breed               101475 non-null object
Color               101475 non-null object
dtypes: object(12)
memory usage: 9.3+ MB

What are the breed `value_counts`?
What's the top breed for adopted dogs?

How about outcome counts for dogs?

In [36]:
animal_outcomes['Breed'].value_counts(dropna=False).head()

Domestic Shorthair Mix      29574
Pit Bull Mix                 7849
Labrador Retriever Mix       6111
Chihuahua Shorthair Mix      5941
Domestic Medium Hair Mix     2971
Name: Breed, dtype: int64

In [43]:
# 1. cast a mask for conditional indexing
mask = (animal_outcomes['Outcome Type'] == 'Adoption')&(animal_outcomes['Animal Type']=='Dog')
# 2. df.loc[mask, col_of_interest].function()
animal_outcomes.loc[mask,'Breed'].value_counts().head()

Labrador Retriever Mix       3080
Pit Bull Mix                 3037
Chihuahua Shorthair Mix      2840
German Shepherd Mix          1345
Australian Cattle Dog Mix     745
Name: Breed, dtype: int64

In [44]:
mask = animal_outcomes['Animal Type'] =='Dog'
animal_outcomes.loc[mask,'Outcome Type'].value_counts(dropna=False)

Adoption           26872
Return to Owner    16545
Transfer           12455
Euthanasia          1623
Rto-Adopt            326
Died                 202
Missing               20
Disposal              11
NaN                    1
Name: Outcome Type, dtype: int64

### 2.  Changing data

#### DataFrame.applymap() and Series.map()

The ```.applymap()``` method takes a function as input that it will then apply to every entry in the dataframe.

```python
.applymap() or .map()
# not inplace, if needed, do df = df.applymap()
```

```python
conditional selecting cols (maybe): df.columns.dtype
```

In [45]:
def successor(x):
    return x + 1

In [47]:
uci.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

In [46]:
uci.applymap(successor).head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,64,2,4,146,234,2,1,151,1,3.3,1,1,2,2
1,38,2,3,131,251,1,2,188,1,4.5,1,1,3,2
2,42,1,2,131,205,1,1,173,1,2.4,3,1,3,2
3,57,2,2,121,237,1,2,179,1,1.8,3,1,3,2
4,58,1,1,121,355,1,2,164,2,1.6,3,1,3,2

The `.map()` method takes a function as input that it will then apply to every entry in the Series.

In [49]:
uci['age'].map(successor).tail(10)

293    68
294    45
295    64
296    64
297    60
298    58
299    46
300    69
301    58
302    58
Name: age, dtype: int64

#### Anonymous Functions (Lambda Abstraction)

Simple functions can be defined right in the function call. This is called 'lambda abstraction'; the function thus defined has no name and hence is "anonymous".

In [50]:
uci['oldpeak'].map(lambda x: round(x))[:4]

0    2
1    4
2    1
3    1
Name: oldpeak, dtype: int64

In [55]:
uci['oldpeak'].map(round)[:4]

0    2
1    4
2    1
3    1
Name: oldpeak, dtype: int64

Exercise: Use an anonymous function to turn the entries in age to strings

In [53]:
uci['age'].astype(str).head()

0    63
1    37
2    41
3    56
4    57
Name: age, dtype: object

In [54]:
uci['age'].map(lambda x:str(x)).head()

0    63
1    37
2    41
3    56
4    57
Name: age, dtype: object

### Apply to Animal Shelter Data

Use an `apply` to change the dates from strings to datetime objects. Similarly, use an apply to change the ages of the animals from strings to floats.

In [56]:
# Your code here
animal_outcomes.head()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
0,A796161,NaN,06/09/2019 07:55:00 PM,06/09/2019 07:55:00 PM,03/29/2019,Adoption,NaN,Cat,Spayed Female,2 months,Domestic Shorthair,Black/White
1,A794633,NaN,06/09/2019 07:42:00 PM,06/09/2019 07:42:00 PM,04/10/2019,Adoption,NaN,Cat,Intact Female,1 month,Domestic Medium Hair,Torbie
2,A788507,Rocket,06/09/2019 07:40:00 PM,06/09/2019 07:40:00 PM,08/03/2017,Adoption,NaN,Dog,Neutered Male,1 year,Labrador Retriever,Brown/White
3,A796624,*Perot,06/09/2019 07:18:00 PM,06/09/2019 07:18:00 PM,06/03/2018,Adoption,NaN,Dog,Neutered Male,1 year,Dalmatian Mix,White/Black
4,A796743,NaN,06/09/2019 07:14:00 PM,06/09/2019 07:14:00 PM,04/19/2019,Adoption,NaN,Cat,Intact Male,1 month,Domestic Shorthair,Brown Tabby/White

In [60]:
animal_outcomes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101475 entries, 0 to 101474
Data columns (total 12 columns):
Animal ID           101475 non-null object
Name                69834 non-null object
DateTime            101475 non-null object
MonthYear           101475 non-null object
Date of Birth       101475 non-null object
Outcome Type        101468 non-null object
Outcome Subtype     46103 non-null object
Animal Type         101475 non-null object
Sex upon Outcome    101473 non-null object
Age upon Outcome    101455 non-null object
Breed               101475 non-null object
Color               101475 non-null object
dtypes: object(12)
memory usage: 9.3+ MB

In [ ]:
pd.DataFrame.dtypes

In [58]:
animal_outcomes['DateTime'].dtypes

dtype('O')

In [59]:
animal_outcomes['MonthYear'].dtypes

dtype('O')

In [64]:
pd.to_datetime(animal_outcomes['DateTime'].head())

0   2019-06-09 19:55:00
1   2019-06-09 19:42:00
2   2019-06-09 19:40:00
3   2019-06-09 19:18:00
4   2019-06-09 19:14:00
Name: DateTime, dtype: datetime64[ns]

**Map vs Apply**

```python
s = pd.Series(['cat', 'dog', np.nan, 'rabbit'])
>>> s
0      cat
1      dog
2      NaN
3   rabbit
dtype: object
    
s.map({'cat': 'kitten', 'dog': 'puppy'})
0   kitten
1    puppy
2      NaN
3      NaN
dtype: object
```

## 3. Methods for Re-Organizing DataFrames
#### `.groupby()`

Those of you familiar with SQL have probably used the GROUP BY command. Pandas has this, too.

The `.groupby()` method is especially useful for aggregate functions applied to the data grouped in particular ways.

In [65]:
uci.groupby('sex')

#### `.groups` and `.get_group()`

In [66]:
uci.groupby('sex').groups

{0: Int64Index([  2,   4,   6,  11,  14,  15,  16,  17,  19,  25,  28,  30,  35,
              36,  38,  39,  40,  43,  48,  49,  50,  53,  54,  59,  60,  65,
              67,  69,  74,  75,  82,  84,  85,  88,  89,  93,  94,  96, 102,
             105, 107, 108, 109, 110, 112, 115, 118, 119, 120, 122, 123, 124,
             125, 127, 128, 129, 130, 131, 134, 135, 136, 140, 142, 143, 144,
             146, 147, 151, 153, 154, 155, 161, 167, 181, 182, 190, 204, 207,
             213, 215, 216, 220, 223, 241, 246, 252, 258, 260, 263, 266, 278,
             289, 292, 296, 298, 302],
            dtype='int64'),
 1: Int64Index([  0,   1,   3,   5,   7,   8,   9,  10,  12,  13,
             ...
             288, 290, 291, 293, 294, 295, 297, 299, 300, 301],
            dtype='int64', length=207)}

In [68]:
uci.groupby('sex').get_group(0).tail()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
289,55,0,0,128,205,0,2,130,1,2.0,1,1,3,0
292,58,0,0,170,225,1,0,146,1,2.8,1,2,1,0
296,63,0,0,124,197,0,1,136,1,0.0,1,0,2,0
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

In [70]:
uci.groupby('sex').chol.mean()

sex
0    261.302083
1    239.289855
Name: chol, dtype: float64

### Aggregating

In [72]:
uci.groupby('age').std().head()

,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
age,,,,,,,,,,,,,
29,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
34,0.707107,1.414214,0.000000,19.798990,0.0,0.707107,12.727922,0.00000,0.494975,0.000000,0.000000,0.00000,0.00000
35,0.500000,0.500000,8.062258,45.915684,0.0,0.500000,23.057898,0.57735,0.869866,0.500000,0.000000,0.57735,0.57735
37,0.707107,0.000000,7.071068,24.748737,0.0,0.000000,12.020815,0.00000,2.474874,1.414214,0.000000,0.00000,0.00000
38,0.000000,0.577350,10.392305,32.331615,0.0,0.000000,5.196152,0.57735,2.193931,0.577350,2.309401,0.57735,0.57735

Exercise: Tell me the average cholesterol level for those with heart disease.

In [74]:
# Your code here!
uci.target.value_counts()

1    165
0    138
Name: target, dtype: int64

In [77]:
uci.groupby('target').chol.mean()

target
0    251.086957
1    242.230303
Name: chol, dtype: float64

In [76]:
uci.groupby('target').get_group(1).chol.mean()

242.23030303030302

### Apply to Animal Shelter Data

#### Task 1
- Use a groupby to show the average age of the different kinds of animal types.
- What about by animal types **and** gender?

#### Task 2:
- Create new columns `year` and `month` by using a lambda function x.year on date
- Use `groupby` and `.size()` to tell me how many animals are adopted by month

In [ ]:
# Your code here

## 4. Reshaping a DataFrame

### `.pivot()`

Those of you familiar with Excel have probably used Pivot Tables. Pandas has a similar functionality.

In [78]:
uci.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

In [80]:
uci.pivot_table(values ='oldpeak', index = ['age','sex']).head()

          oldpeak
age sex
29  1    0.000000
34  0    0.700000
    1    0.000000
35  0    1.400000
    1    0.533333

In [81]:
uci.pivot(values = 'sex', columns = 'target').head()

target   0    1
0      NaN  1.0
1      NaN  1.0
2      NaN  0.0
3      NaN  1.0
4      NaN  0.0

### Methods for Combining DataFrames: `.join()`, `.merge()`, `.concat()`, `.melt()`

### `.join()`

In [83]:
toy1 = pd.DataFrame([[63, 142], [33, 47]], columns = ['age', 'HP'])
toy2 = pd.DataFrame([[63, 100], [33, 200]], columns = ['age', 'HP'])

In [84]:
toy1

   age   HP
0   63  142
1   33   47

In [85]:
toy2

   age   HP
0   63  100
1   33  200

In [86]:
toy2.index

RangeIndex(start=0, stop=2, step=1)

In [87]:
toy1.join(toy2.set_index('age'),
          on = 'age',
          lsuffix = '_A',
          rsuffix = '_B').head()

   age  HP_A  HP_B
0   63   142   100
1   33    47   200

In [90]:
toy1.join(toy2.set_index('age'),
          lsuffix = '_A',
          rsuffix = '_B').head()

   age  HP_A  HP_B
0   63   142   NaN
1   33    47   NaN

In [88]:
toy1.join(toy2,
          lsuffix = '_A',
          rsuffix = '_B').head()

   age_A  HP_A  age_B  HP_B
0     63   142     63   100
1     33    47     33   200

In [89]:
toy1.join(toy2, #default index of toy2
          on = 'age', #on toy1 age col
          lsuffix = '_A',
          rsuffix = '_B').head()

   age_A  HP_A  age_B  HP_B
0     63   142    NaN   NaN
1     33    47    NaN   NaN

### `.merge()`

In [91]:
ds_chars = pd.read_csv('ds_chars.csv', index_col = 0)

In [92]:
states = pd.read_csv('states.csv', index_col = 0)

In [93]:
ds_chars

     name   HP home_state
0    greg  200         WA
1   miles  200         WA
2    alan  170         TX
3  alison  300         DC
4  rachel  200         TX

In [94]:
states

  state   nickname     capital
0    WA  evergreen     Olympia
1    TX      alamo      Austin
2    DC   district  Washington
3    OH    buckeye    Columbus
4    OR     beaver       Salem

In [95]:
ds_chars.merge(states,
               left_on='home_state',
               right_on = 'state',
               how = 'inner')

     name   HP home_state state   nickname     capital
0    greg  200         WA    WA  evergreen     Olympia
1   miles  200         WA    WA  evergreen     Olympia
2    alan  170         TX    TX      alamo      Austin
3  rachel  200         TX    TX      alamo      Austin
4  alison  300         DC    DC   district  Washington

### `pd.concat()`

Exercise: Look up the documentation on pd.concat (https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html) and use it to concatenate ds_chars and states.
<br/>
Your result should still have only five rows!

In [96]:
pd.concat([ds_chars, states])

/Users/tingtingli/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

      HP     capital home_state    name   nickname state
0  200.0         NaN         WA    greg        NaN   NaN
1  200.0         NaN         WA   miles        NaN   NaN
2  170.0         NaN         TX    alan        NaN   NaN
3  300.0         NaN         DC  alison        NaN   NaN
4  200.0         NaN         TX  rachel        NaN   NaN
0    NaN     Olympia        NaN     NaN  evergreen    WA
1    NaN      Austin        NaN     NaN      alamo    TX
2    NaN  Washington        NaN     NaN   district    DC
3    NaN    Columbus        NaN     NaN    buckeye    OH
4    NaN       Salem        NaN     NaN     beaver    OR

### `pd.melt()`

Melting removes the structure from your DataFrame and puts the data in a 'variable' and 'value' format.

In [97]:
ds_chars.head()

     name   HP home_state
0    greg  200         WA
1   miles  200         WA
2    alan  170         TX
3  alison  300         DC
4  rachel  200         TX

In [99]:
melted = pd.melt(ds_chars,
        id_vars=['name'],
        value_vars=['HP', 'home_state'])
melted

     name    variable value
0    greg          HP   200
1   miles          HP   200
2    alan          HP   170
3  alison          HP   300
4  rachel          HP   200
5    greg  home_state    WA
6   miles  home_state    WA
7    alan  home_state    TX
8  alison  home_state    DC
9  rachel  home_state    TX

In [100]:
melted.pivot(index='name', values='value', columns ='variable')

variable   HP home_state
name
alan      170         TX
alison    300         DC
greg      200         WA
miles     200         WA
rachel    200         TX

In [ ]:
# pivot_table has default agg function .mean()

## Bringing it all together with the Animal Shelter Data

Join the data from the [Austin Animal Shelter Intake dataset](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Intakes/wter-evkm) to the outcomes dataset by Animal ID.

Use the dates from each dataset to see how long animals spend in the shelter. Does it differ by time of year? By outcome?

The Url for the Intake Dataset is here: https://data.austintexas.gov/api/views/wter-evkm/rows.csv?accessType=DOWNLOAD

_Hints_ :
- import and clean the intake dataset first
- use apply/applymap/lambda to change the variables to their proper format in the intake data
- rename the columns in the intake dataset *before* joining
- create a new days-in-shelter variable
- Notice that some values in "days_in_shelter" column are NaN or values < 0 (remove these rows using the "<" operator and ~is.na())
- Use group_by to get some interesting information about the dataset

Make sure to export and save your cleaned dataset. We will use it in a later lecture!

use the notation `df.to_csv()` to write the `df` to a csv. Read more about the `to_csv()` documentation [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html)

In [ ]:
#code here